## 3.1 数据
# 英雄昵称
HEROES_LIST_CHINESE = {
    1: '敌法师',2: '斧王',3: '痛苦之源',4: '血魔',5: '冰女',6: '小黑',7: '撼地神牛',8: '奶棒人',9: '白虎',10: '水人',11: '影魔',12: '幻影长矛手',13: '帕克',14: '屠夫',15: '电魂',16: '沙王',17: '蓝猫',18: '斯温',19: '小小',20: '复仇之魂',21: '风行',22: '宙斯',23: '船长',25: '火女',26: '莱恩',27: '小y',28: '大鱼',29: '潮汐',30: '巫医',31: '巫妖',32: '力丸',33: '谜团',34: 'tk',35: '火枪',36: '瘟疫法师',37: '术士',38: '兽王',39: '女王',40: '剧毒',41: '虚空',42: '骷髅王',43: '死亡先知',44: '幻影刺客',45: '帕格纳',46: '圣堂刺客',47: '毒龙',48: 'Luna',49: '龙骑士',50: '戴泽',51: '发条',52: '拉席克',53: "先知",
    54: '小狗',55: '黑暗贤者',56: '克林克兹',57: '全能',58: '小鹿',59: '哈斯卡',60: '夜魔',61: '蜘蛛',62: '赏金',63: '蚂蚁',64: '双头龙',65: '蝙蝠',66: '陈',67: '幽鬼',68: '冰魂',69: 'Doom',70: '拍拍熊',71: '白牛',72: '飞机',73: '炼金',74: '卡尔',75: '沉默',76: '黑鸟',77: '狼人',78: '兽王',79: '毒狗',80: '德鲁伊',81: '混沌骑士',82: '米波',83: '大树',84: '蓝胖',85: '尸王',86: '拉比克',87: '萨尔',88: '小强',89: '小娜迦',90: '光之守卫',91: '小精灵',92: '死灵龙',93: '小鱼',94: '美杜莎',95: '巨魔战将',96: '人马',97: '猛犸',98: '伐木机',99: '钢背兽',100: '海民',101: '天怒',102: '亚巴顿',103: '大牛',104: '军团',105: '炸弹人',106: '火猫',107: '土猫',108: '大屁股',109: '恐怖利刃',110: '凤凰',111: '神谕者',112: '冰龙',113: '电狗',114: '大圣',119: '小仙女',120: '滚滚',121: '墨客',126: '紫猫',128: '老奶奶',129: '玛尔斯',135:'锤女'}


# 可以在这里添加新的阴阳怪气
WIN_NEGATIVE = [
    '侥幸赢得了比赛',
    '走狗屎运赢得了比赛',
    '躺赢了比赛',
    '打团都没来, 队友4V5赢得了比赛.'
]

WIN_POSTIVE = [
    '带领团队轻轻松松走向了胜利！',
    '暴打对面后赢得了胜利，太狠了吧！',
    ' CARRY全场后获得胜利，不是，要不谁来管管？',
    '把对面当猪宰了, 赢得了胜利.',
    '又赢了, 这游戏就是这么枯燥, 且乏味',
]

LOSE_NEGATIVE = [
    '被人按在地上摩擦, 输掉了这场比赛',
    '悲惨地输掉了比赛，难受',
    '头都被打歪了, 心态爆炸地输掉了比赛.',
    '捕鱼被鱼吃了, 输掉了比赛.',
]

LOSE_POSTIVE = [
    '尽力了, 但还是输了比赛.',
    '无力回天输掉了比赛.',
    '背靠世界树, 虽败犹荣.',
    '带不动队友, 输了比赛',
    '又输了, 很难受, 宁愿输的是我',
]

robot_at_response = [
    '哦吼',
    '你艾特你马呢？',
    '老子忙，别烦我。',
    '有事没事记得打两把刀塔。',
    '我听不懂你说啥，别废话。',
    '你们聊，我听着。',
    '？',
    '好好说话别这样，我不和人类一般见识。',
    '别吵，我在和童哥对线',
    '你很闲吗，有空去学烁哥第一视角，一帧一帧学',
    '今晚打游戏吗？'
]

Tips_Response = [
    '天梯模式天辉的胜率高达53.3%， 匹配模式中天辉诗律为52.4%',
    '常规dota比赛中，天梯模式占比73.5%',
    '当前版本游戏平均时间为40.0分钟',
    '夜魇获胜的平均时间要比天辉长60-70秒',


]